app/Jobs/Shopify/Sync/OneOrder.php

                            $total_shipping += $ship['price'];
                        }
                        $db_order->subtotal_price = $temp_payload['total_price'] - $total_shipping;
                        $db_order->save();
---
update `orders` set `subtotal_price` = 2870, `total_price` = '2925.00' where `id` = 5781751791866

                            foreach($ref->refund_line_items as $key=>$line) {
                                if($line && isset($line->line_item_id))
                                {
                                    $refund = Refund::where('refund_id', json_decode($temp_payload['refunds'])[0]->id)->where('line_item_id',$line->line_item_id)->first();
---
select * from `refunds` where `refund_id` = 897784774906 and `line_item_id` = 14220667027706 limit 1


                                    if($db_order) {
                                        $db_order->total_price -= $refund->amount;
                                        $db_order->save();
---
update `orders` set `total_price` = 1665 where `id` = 5781751791866