app/Jobs/Shopify/Sync/WarehouseProduct.php

                }

                foreach($products as $product) {
                    $prod = ModelsProductVariant::where('inventory_item_id', $product['inventory_item_id'])->first();
---
select * from `product_variants` where `inventory_item_id` = 47954667667706 limit 1