app/Http/Controllers/Controller.php

select * from `stores` limit 1
---
    public function __construct()
    {
        $user = Auth::user();
        $store = $user?$user->getShopifyStore:Store::first();