app/Http/Controllers/CustomerController.php

select `id`, `name`, `phone_number` from `customers` where `phone_number` = '01012821275'
---
    public function getCustomerSale($phone)
    {

        $lims_customer_list = Customer::select('id', 'name', 'phone_number')->where('phone_number', $phone)->get();