app/Http/Controllers/HomeController.php

select * from `stores` limit 1
---
    public function __construct() {
                $user = Auth::user();
        $store = $user?$user->getShopifyStore:Store::first();

select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null
select * from `users` where `role_id` = '5'
---
    private function getDashboardPayload($user, $store,$data) {
        try {
            $orders = $store->getOrders();
            if(isset($data['filter']))
            {
                if ($data['filter'] == "today")
                    $orders = $orders->whereDate('created_at_date', now()->toDateString());
                elseif ($data['filter'] == "month")
                    $orders = $orders->whereYear('created_at_date', now()->year)
                    ->whereMonth('created_at_date', now()->month);
                elseif ($data['filter'] == "year")
                    $orders = $orders->whereYear('created_at_date', now()->year);
            }
            $prepares = $store->getPrepares();
            $all_prepares = $prepares->get();
            $prepare_users_list = [];
            $prepare_users = User::where('role_id', '5')->get();

select * from `order_histories` order by `created_at` desc limit 10
---
                    $prepare_users_list['fulfilled'][$key] = $all_prepares->where('assign_to',$prepare->id)->where('delivery_status','fulfilled')->count();
                }
            }
            $activities = OrderHistory::orderBy('created_at','desc')->limit(10)->get();

select `product_name`, `variant_image`, `price`, COUNT(*) as total from `prepare_product_lists` group by `product_name`, `variant_image`, `price` order by `total` desc limit 10
select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null order by `created_at_date` desc limit 10
select count(*) as aggregate from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null
select count(*) as aggregate from `customers` where `customers`.`store_id` = 1 and `customers`.`store_id` is not null
---
                elseif ($data['filter'] == "year")
                    $activities = $activities->whereYear('created_at', now()->year);
            }
            $mostSellingProducts = PrepareProductList::select('product_name','variant_image','price', DB::raw('COUNT(*) as total'))
            ->groupBy('product_name','variant_image','price')
            ->orderBy('total', 'desc')->limit(10)
            ->get();
            // dd($prepare_users_list);
            return [
                'orders_count' => $orders->count() ?? 0,
                'orders_revenue' => $orders->sum('total_price') ?? 0,
                'customers_count' => $store->getCustomers()->count() ?? 0,
                'recent_sales' => $orders->orderBy('created_at_date','desc')->limit(10)->get(),
                'reports' => $prepare_users_list,
                'activities' => $activities,
                'most_selling' => $mostSellingProducts,
            ];