app/Http/Controllers/ShopifyController.php

select * from `stores` limit 1
---
    public function __construct() {
        $this->middleware('auth');
        $user = Auth::user();
        $store = $user?$user->getShopifyStore:Store::first();

select * from `customers` where `phone_number` = '01021601747' limit 1
---
    public function store_order(Request $request)
    {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $headers = getShopifyHeadersForStore($store, 'POST');
        $endpoint = getShopifyURLForStore('orders.json', $store);
        $line_items = [];
        $customer = Customer2::where('phone_number', $request->get_customer_sale)->first();

select * from `cash_registers` where `user_id` = 13 and `status` = 'open' limit 1
---
                $order_id = $response['body']['order']['id'];
                OneOrder::dispatchNow($user,$store,$order_id);
                            $user_id = auth()->user()->id;
                $register =  CashRegister::where('user_id', $user_id)
                    ->where('status', 'open')
                    ->first();

insert into `cash_register_transactions` (`amount`, `pay_method`, `type`, `transaction_type`, `sale_id`, `cash_register_id`, `updated_at`, `created_at`) values ('3000.00', '1', 'credit', 'sell', 5785374851322, 2, '2024-08-04 08:20:07', '2024-08-04 08:20:07')
select * from `sales` where `sales`.`id` = 5785374851322 limit 1
---
                    'sale_id' => $order_id
                ]);
                if (!empty($payment)) {
                    $register->cash_register_transactions()->save($payment);
                }
                $order = Sale::find($order_id);

insert into `prepares` (`order_id`, `store_id`, `table_id`, `assign_by`, `assign_to`, `status`, `type`, `delivery_status`, `sale_created_at`, `created_at`, `updated_at`) values (5785374851322, 1, 17, 13, 13, '3', 'pos', 'fulfilled', '2024-08-04 11:20:07', '2024-08-04 08:20:07', '2024-08-04 08:20:07')
delete from `prepare_product_lists` where `order_id` = 5785374851322
---
                    $add_to_prepare->sale_created_at = $order->created_at_date;
                    $add_to_prepare->created_at = now();
                    $add_to_prepare->updated_at = now();
                    $add_to_prepare->save();
                    $prepare_product = PrepareProductList::where('order_id', $order->id)->delete();

select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null
---
    public function all_orders(Request $request) {

        $date = $request->date;
        $sort_search = null;
        $delivery_status = null;
        $payment_status = '';
        $prepare_users_list = [];

        $user = Auth::user();
        $store = $user->getShopifyStore;
        $orders = $store->getPrepares();

        $all_orders = $store->getOrders()->get();

        $all_prepares = $orders->get();

select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null
---
    public function all_sales(Request $request) {

        $date = $request->date;
        $sort_search = null;
        $delivery_status = null;
        $payment_status = '';
        $prepare_users_list = [];

        $user = Auth::user();
        $store = $user->getShopifyStore;
        $orders = $store->getPrepares();

        $all_orders = $store->getOrders()->get();

        $all_prepares = $orders->get();

select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `delivery_status` = 'distributed' and `assign_to` = 12 order by `table_id` asc limit 16 offset 0
---
    public function new_orders() {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        if($user->id == 1 || $user->id == 2)
        $orders = $store->getPrepares()->where('delivery_status','distributed')->orderBy('table_id', 'desc')
                ->simplePaginate(15);
        else
        $orders = $store->getPrepares()->where('delivery_status','distributed')
                ->where('assign_to',$user->id)->orderBy('table_id', 'asc')
                ->simplePaginate(15);

select * from `employees` where `warehouse_id` = 77177291002
select * from `cash_registers` where `user_id` = 13 and `status` = 'open' limit 1
---
    public function pos()
    {
        $user = Auth::user();
        $warehouse_id = $user->warehouse_id;

        if ($this->countOpenedRegister() != 0) {


            $lims_customer_list = Customer2::select('id','name','phone_number')->where('is_active', true)->limit(1)->get();
            $lims_product_list = WarehouseProduct2::select('id', 'title', 'barcode', 'image_id', 'sku')->where('warehouse_id',$warehouse_id)->limit(15)->get();
            $employees = Employee::where('warehouse_id', $warehouse_id)->get();
            $product_number = 20;
            $cashRegister = CashRegister::where('user_id', Auth::user()->id)
                            ->where('status', 'open')
                            ->first();
            return view('orders.pos', compact('lims_customer_list','employees', 'lims_product_list','warehouse_id', 'product_number', 'cashRegister'));
        }else{
            $register = CashRegister::where('user_id', Auth::user()->id)
                ->latest()->first();

select count(*) as aggregate from `cash_registers` where `user_id` = 13 and `status` = 'open'
---
    public function countOpenedRegister()
    {
        $user_id = auth()->user()->id;
        $count =  CashRegister::where('user_id', $user_id)
                                ->where('status', 'open')
                                ->count();

select * from `prepares` where `order_id` = 5784274239738 limit 1
select * from `prepare_product_lists` where `prepare_id` = 886 limit 1
select `line_item_id` from `refunds` where `order_name` = '#2521'
select `id` from `returned_orders` where `order_number` = '2521'
select `line_item_id` from `return_details` where `return_id` in (26)
---
    public function prepareOrder($id)
    {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $order = order2::where('name','like','%'. $id.'%')->first();
        if(!$order)
        $order = Sale::where('name','like','%'. $id.'%')->first();

        if ($user->role_id == 6 && $order->fulfillment_status != "shipped")
            return redirect()->back()->with('error',"Youre not permitted to view this page");

        $product_images = $store->getProductImagesForOrder($order);

        $prepare = Prepare::where('order_id', $order->id)->first();

        $prepare_products = PrepareProductList::where('prepare_id', $prepare->id)->first();
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();
        $returns = [];
        $return = ReturnedOrder::where('order_number', $order->order_number)->pluck('id')->toArray();
        if ($return)
            $returns = ReturnDetail::whereIn('return_id', $return)->pluck('line_item_id')->toArray();

select * from `users` where `users`.`id` = '12' limit 1
update `orders` set `fulfillment_status` = 'distributed', `status` = '3' where `id` = 5785510117626
select * from `prepares` where `order_id` = 5785510117626 limit 1
delete from `prepares` where `id` = 877
---
    public function assignOrders($id,$prepare_emp)
    {
        $prepare_employee = User::find($prepare_emp);
        $order = order2::find($id);

        $user = Auth::user();
        $store = $user->getShopifyStore;
        if ($order != null) {

                try {
                    $order = order2::where('id',$id)->first();
                    $order->status = "3";
                    $order->fulfillment_status = "distributed";
                    $order->save();

                    // Add TO Prepare
                    //firstornew
                    $add_to_prepare = Prepare::where('order_id',$order->id)->first();
                    if($add_to_prepare){
                        $add_to_prepare->delete();

insert into `prepares` (`order_id`, `store_id`, `table_id`, `assign_by`, `assign_to`, `status`, `delivery_status`, `sale_created_at`, `created_at`, `updated_at`) values (5785510117626, 1, 919, 1, '12', '3', 'distributed', '2024-08-04 14:29:04', '2024-08-04 11:29:38', '2024-08-04 11:29:38')
delete from `prepare_product_lists` where `order_id` = 5785510117626
---
                    $add_to_prepare->sale_created_at  = $order->created_at_date;
                    $add_to_prepare->created_at  = now();
                    $add_to_prepare->updated_at  = now();
                    $add_to_prepare->save();
                    $prepare_product = PrepareProductList::where('order_id',$order->id)->delete();

select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null and `table_id` = '917' limit 1
select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null and `table_id` = '873' limit 1
select `line_item_id` from `refunds` where `order_name` = '#2576'
---
    public function showOrder($id) {
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $order = $store->getOrders()->where('table_id', $id)->first();
        if($order->getFulfillmentOrderDataInfo()->doesntExist())
            OrderFulfillments::dispatch($user, $store, $order);
        $product_images = $store->getProductImagesForOrder($order);
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();

select * from `prepares` where `order_id` = '5781751791866' limit 1
select `line_item_id` from `refunds` where `order_name` = '#2425'
---
    public function review_order($id)
    {
        $order = order2::where('id', $id)->first();
        $prepare = Prepare::where('order_id', $id)->first();
        $order_currency=getCurrencySymbol($order->currency);
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $product_images = $store->getProductImagesForOrder($order);
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();

select * from `users` where `role_id` = '4'
---
    public function reviewed_orders(Request $request)
    {
        $date = $request->date;
        $sort_search = null;
        $delivery_status = null;
        $payment_status = '';
        $prepare_users_list = [];
        $paginate_num = 0;
        $orders_count = order2::where('fulfillment_status', 'fulfilled')->count();
        $orders = order2::where('fulfillment_status', 'fulfilled')->orderBy('id', 'desc');

        $prepare_users = User::where('role_id', '4')->get();

select * from `prepares` where `order_id` = 5781751791866 limit 1
select `line_item_id` from `refunds` where `order_name` = '#2425'
select * from `orders` where `order_number` = '2468' limit 1
select * from `prepares` where `order_id` = 5783355851002 limit 1
select `line_item_id` from `refunds` where `order_name` = '#2553'
update `orders` set `fulfillment_status` = 'reviewed', `status` = 8 where `id` = 5781751791866
update `prepares` set `delivery_status` = 'reviewed' where `id` = 789
---
    public function review_post(Request $request)
    {
        $data = $request->all();
        $auth_id = auth()->user()->id;
        $auth_user = auth()->user()->name;
        $user = Auth::user();
        $store = $user->getShopifyStore;

        $order = order2::where('order_number', $request['order_id'])->first();
        $prepare = Prepare::where('order_id', $order->id)->first();
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();

        if($order->getFulfillmentOrderDataInfo()->doesntExist()){
            OrderFulfillments::dispatch($user, $store, $order);
        }

        if($order)
        {
            $order->fulfillment_status = "reviewed";
            $order->status = 8;
            $order->save();
            $data['name'] = $order->name;
        }
        if($prepare)
        {
            $prepare->delivery_status = 'reviewed';
            $prepare->save();

select * from `prepare_product_lists` where `product_id` = '14220667027706' and `order_id` = 5781751791866 limit 1
---
        $posted_data2 = [];
        foreach ($request['line_item_id'] as $key => $item) {

            $prepare_product = PrepareProductList::where('product_id', $item)->where('order_id', $order->id)->first();

update `prepares` set `delivery_status` = 'fulfilled' where `id` = 789
---
        if ($prepare->delivery_status != "fulfilled")
        {
            $prepare->delivery_status = 'fulfilled';
            $prepare->save();

update `orders` set `fulfillment_status` = 'fulfilled', `status` = 10 where `id` = 5781751791866
---
        {
            $order->fulfillment_status = "fulfilled";
            $order->status = 10;
            $order->save();

select * from `prepares` where `order_id` = '5785515491578' limit 1
---
    public function bulk_order_shipped(Request $request)
    {
        $sales = array();
        $key = 1;
        $auth_user = Auth::user()->id;
        $sale_id = $request['id'];

        $csvData=array('AWB,Name,Addr1,Addr2,Phone,Mobile,City,zone,Contents,Weight,Peices,Shipping Cost,Special Instructions,Ref,Contact Person,COD,AWBxAWB');
        $csvAccountingData=array('AWB,Name,Addr1,Mobile,City,zone,subtotal,shipping,total,Payment Method,Special Instructions,Shipping Note');

        foreach ($sale_id as $id) {

            $sale_data = order2::findorfail($id);
            $sale_prepare_data = Prepare::where('order_id',$id)->first();

update `prepares` set `status` = '10', `delivery_status` = 'shipped' where `id` = 944
---
            {
                $sale_prepare_data->delivery_status = 'shipped';
                $sale_prepare_data->status = '10';
                $sale_prepare_data->save();

insert into `pickups` (`pickup_id`, `user_id`, `shipment_count`, `company_id`, `file_name`, `file_accounting_name`, `created_at`, `updated_at`) values ('20240804124412', 1, 33, 2, 'pickup-20240804-124412.xlsx', 'pickup-accounting20240804-124412.xlsx', '2024-08-04 12:44:12', '2024-08-04 12:44:12')
---
        $create_pickup->file_accounting_name = $accountFileName;
        $create_pickup->created_at = now();
        $create_pickup->updated_at = now();
        $create_pickup->save();

select * from `sales` where `sales`.`id` = 5785374851322 limit 1
select `line_item_id` from `refunds` where `order_name` = '#2544'
select * from `prepare_product_lists` where `order_id` = 5785374851322 and `table_id` = 17 and 1 = 1
---
    public function generate_invoice($id)
    {
        $order = order2::find($id);
        if(!$order)
        $order = Sale::find($id);
        $refunds = Refund::where('order_name', $order->name)->pluck('line_item_id')->toArray();
        $order_details = PrepareProductList::where('order_id', $id)->where('table_id', $order->table_id)->whereNotIn('product_id',$refunds)->get();

select * from `returned_orders` where `returned_orders`.`id` = '25' limit 1
---
    public function generate_return_invoice($id)
    {
        $return = ReturnedOrder::findOrFail($id);

select * from `orders` where `orders`.`id` = '5782492446970' limit 1
update `orders` set `fulfillment_status` = 'cancelled', `status` = '14' where `id` = 5782492446970
select * from `prepares` where `order_id` = 5782492446970 limit 1
delete from `prepares` where `id` = 812
select * from `prepare_product_lists` where `order_id` = 5782492446970
select * from `prepare_product_lists` where `prepare_product_lists`.`id` = 1352 limit 1
delete from `prepare_product_lists` where `id` = 1352
---
    public function update_delivery_status(Request $request)
    {
        if($request->status == 'cancelled') {
            $user = Auth::user();
            $store = $user->getShopifyStore;
            $order = order2::findOrFail($request->order_id);
            $order->fulfillment_status = $request->status;
            $order->status = '14';


            $order->save();
            $get_prepare_order = Prepare::where('order_id',$order->id)->first();

            if($get_prepare_order){

                $get_prepare_order->delete();
                $get_prepare_order_details = PrepareProductList::where('order_id',$order->id)->get();
                if(count($get_prepare_order_details)){
                    foreach ($get_prepare_order_details as $detail) {
                        $detail_record = PrepareProductList::find($detail->id);
                        $detail_record->delete();

select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null and `table_id` = 853 limit 1
select * from `orders` where `orders`.`store_id` = 1 and `orders`.`store_id` is not null and `table_id` = 874 limit 1
select * from `prepares` where `prepares`.`store_id` = 1 and `prepares`.`store_id` is not null and `table_id` = 853 limit 1
select * from `prepare_product_lists` where `product_id` = '14224953934074' and `order_id` = 5783958683898 limit 1
---
    public function fulfillOrderItems(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'product_status.*' => 'required',]
            , [
                'product_status.*.required' => 'This field is required.',
            ]);

        if ($validator->fails()) {
            return redirect()->back()->withErrors($validator)->withInput();
        }
        $request = $request->all();
        $posted_data = [];
        $user = Auth::user();
        $store = $user->getShopifyStore;
        $order = $store->getOrders()->where('table_id', (int) $request['order_id'])->first();
        $prepare = $store->getPrepares()->where('table_id',(int) $request['order_id'])->first();
        if ($prepare->delivery_status == "hold")
            $old_page = "prepare.hold";
        else
            $old_page = "prepare.new";
        $prepare->delivery_status = "prepared";
        $order->fulfillment_status = "prepared";
        foreach($request['line_item_id'] as $key => $item)
        {
            $prepare_product = PrepareProductList::where('product_id', $item)->where('order_id', $order->id)->first();

update `orders` set `fulfillment_status` = 'prepared' where `id` = 5783958683898
update `prepares` set `updated_at` = '2024-08-04 11:27:23' where `id` = 825
---
            }
            $prepare_product->save();
        }
        $order->save();
        $prepare->save();

select * from `prepare_product_lists` where `product_id` in ('14222995915002', '14222995947770') and `order_id` = 5783047438586
---
            $add_History_sale->save();
        }
        else{
            $prepare_product = PrepareProductList::whereIn('product_id', $request['line_item_id'])->where('order_id', $order->id)->get();